ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263P/TOP_RCM_TOP_RCM_53200000h.xml
<module name="TOP_RCM" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="TOP_RCM_WARM_RESET_CONFIG" acronym="TOP_RCM_WARM_RESET_CONFIG" offset="4" width="32" description="Warm Reset Config options.">
		<bitfield id="WARM_RESET_CONFIG_WDOG3_RST_EN" width="3" begin="30" end="28" resetval="0x7" description="Enable/Disable WATCHDOG3 triggering Warm ResetData should be loaded as multibit.  Write 3'b000 to disable corresponding Watchdog  Write 3'b111 enable corresponding Watchdog" range="30:28" rwaccess="R/W"/>
	<bitfield id="WARM_RESET_CONFIG_WDOG2_RST_EN" width="3" begin="26" end="24" resetval="0x7" description="Enable/Disable WATCHDOG2 triggering Warm ResetData should be loaded as multibit.  Write 3'b000 to disable corresponding Watchdog  Write 3'b111 enable corresponding Watchdog" range="26:24" rwaccess="R/W"/>
	<bitfield id="WARM_RESET_CONFIG_WDOG1_RST_EN" width="3" begin="22" end="20" resetval="0x7" description="Enable/Disable WATCHDOG1 triggering Warm ResetData should be loaded as multibit.  Write 3'b000 to disable corresponding Watchdog  Write 3'b111 enable corresponding Watchdog" range="22:20" rwaccess="R/W"/>
	<bitfield id="WARM_RESET_CONFIG_WDOG0_RST_EN" width="3" begin="18" end="16" resetval="0x7" description="Enable/Disable WATCHDOG0 triggering Warm ResetData should be loaded as multibit.  Write 3'b000 to disable corresponding Watchdog  Write 3'b111 enable corresponding Watchdog" range="18:16" rwaccess="R/W"/>
	<bitfield id="WARM_RESET_CONFIG_TSENSE1_RST_EN" width="3" begin="14" end="12" resetval="0x0" description="Enable/Disable TEMPSENSE1 triggering Warm ResetData should be loaded as multibit.  Write 3'b000 to disable temperature sensor 1 Write 3'b111 to enable temperature sensor 1 **Note: This bit will only be reset by PORz." range="14:12" rwaccess="R/W"/>
	<bitfield id="WARM_RESET_CONFIG_TSENSE0_RST_EN" width="3" begin="10" end="8" resetval="0x0" description="Enable/Disable TEMPSENSE0 triggering Warm ResetData should be loaded as multibit.  Write 3'b000 to disable temperature sensor 0  Write 3'b111 to enable temperature sensor 0  **Note: This bit will only be reset by PORz." range="10:8" rwaccess="R/W"/>
	<bitfield id="WARM_RESET_CONFIG_DEBUGSS_RST_EN" width="3" begin="6" end="4" resetval="0x7" description="Enable/Disable DEBUGSS triggering Warm ResetData should be loaded as multibit.  Write 3'b000 to disable debugger control on Warm ResetWrite 3'b111 enable debugger control on Warm Reset" range="6:4" rwaccess="R/W"/>
	<bitfield id="WARM_RESET_CONFIG_PAD_BYPASS" width="3" begin="2" end="0" resetval="0x7" description="Bypass the Warm reset from Pad InputData should be loaded as multibit.  Write 3'b000 : Pad Warm Reset pin has control over  warm resetWrite 3'b111 : Pad warm reset pin has no control on warm reset**Note: This bit will only be reset by PORz." range="2:0" rwaccess="R/W"/>
	</register><register id="TOP_RCM_WARM_RESET_REQ" acronym="TOP_RCM_WARM_RESET_REQ" offset="8" width="32" description="Warm Reset Config options.">
		<bitfield id="WARM_RESET_REQ_SW_RST" width="3" begin="2" end="0" resetval="0x7" description="Data should be loaded as multibit.  Write 3'b000 to assert warm reset from SWWrite 3'b111 to deassert warm reset from SW if this is the only source of warm reset" range="2:0" rwaccess="R/W"/>
	</register><register id="TOP_RCM_WARM_RST_CAUSE" acronym="TOP_RCM_WARM_RST_CAUSE" offset="12" width="32" description="Warm Reset Cause Register.">
		<bitfield id="WARM_RST_CAUSE_CAUSE" width="24" begin="23" end="0" resetval="0x65" description="Warm Reset Cause register                                                      24'h000041 - POR reset                                 24'h000042 - Warm reset due to MSS_WDT0                24'h000044 - Warm reset due to MSS_WDT1                24'h000048 - Warm reset due to MSS_WDT2                24'h000050 - Warm reset due to MSS_WDT3                24'h000060 - Warm reset due to TOP_RMC:WARM_RESET_REQ  24'h000040 - External Pad reset                        24'h0000C0 - Warm reset due to HSM_WDT                 24'h000140 - Warm Reset due to Deugger reset           24'h000240 - Warm Reset due to Temp Sense0 Reset       24'h000440 - Warm Reset due to Temp Sense1 Reset       24'h000840 - Warm Reset due to vmon_cmp1_ov            24'h001040 - Warm Reset due to vmon_cmp2_ov            24'h002040 - Warm Reset due to vmon_cmp3_ov            24'h004040 - Warm Reset due to vmon_cmp5_ov            24'h008040 - Warm Reset due to vmon_cmp0_uv            24'h010040 - Warm Reset due to vmon_cmp1_uv            24'h020040 - Warm Reset due to vmon_cmp2_uv            24'h040040 - Warm Reset due to vmon_cmp3_uv            24'h080040 - Warm Reset due to vmon_cmp5_uv            24'h100040 - Warm Reset due to vmon_cmp7_uv            24'h200040 - Warm Reset due to vmon_cmp8_uv            24'h400040 - Warm Reset due to esm                     24'h800040 - Warm Reset due to clk_loss on sys_clk" range="23:0" rwaccess="R"/>
	</register><register id="TOP_RCM_WARM_RST_CAUSE_CLR" acronym="TOP_RCM_WARM_RST_CAUSE_CLR" offset="16" width="32" description="Warm Reset Cause Register Clear.">
		<bitfield id="WARM_RST_CAUSE_CLR_CLEAR" width="3" begin="2" end="0" resetval="0x0" description="Write pulse bit field to 3'b111: Data should be loaded as multibit. Warm Reset Cause register Clear" range="2:0" rwaccess="R/W"/>
	</register><register id="TOP_RCM_RCOSC32K_CTRL" acronym="TOP_RCM_RCOSC32K_CTRL" offset="20" width="32" description="RC OSC 32KHz clock control.">
		<bitfield id="RCOSC32K_CTRL_STOPOSC" width="3" begin="2" end="0" resetval="0x0" description="Stop 32KHz RCOSC. Write 3'b111 to stop clock" range="2:0" rwaccess="R/W"/>
	</register><register id="TOP_RCM_LIMP_MODE_EN" acronym="TOP_RCM_LIMP_MODE_EN" offset="24" width="32" description="Control to enabled limp mode.">
		<bitfield id="LIMP_MODE_EN_COREPLL_LOSS_EN" width="3" begin="10" end="8" resetval="0x0" description="Enable for core pll phase lock loss to generate Limp mode3'b000: will not generate Limp mode [multibit 000]3'b111 :  will generate Limp mode [multibit 111]" range="10:8" rwaccess="R/W"/>
	<bitfield id="LIMP_MODE_EN_XTALCLK_LOSS_EN" width="3" begin="6" end="4" resetval="0x0" description="Enable for crystal_clock_loss to generate Limp mode3'b000: will not generate Limp mode [multibit 000]3'b111 :  will generate Limp mode [multibit 111]" range="6:4" rwaccess="R/W"/>
	<bitfield id="LIMP_MODE_EN_DCC0_ERROR_EN" width="3" begin="2" end="0" resetval="0x0" description="Enable DCC0 Error to generate Limp mode 3'b000: DCC0 Error will not generate Limp mode [multibit 000]3'b111 : DCC0 Error will generate Limp mode [multibit 111]" range="2:0" rwaccess="R/W"/>
	</register><register id="TOP_RCM_PLL_REF_CLK_SRC_SEL" acronym="TOP_RCM_PLL_REF_CLK_SRC_SEL" offset="28" width="32" description="CORE PLL and PERI PLL reference clock select.">
		<bitfield id="PLL_REF_CLK_SRC_SEL_PLL_PERI_REF_CLK_SRC_SEL" width="3" begin="6" end="4" resetval="0x0" description="Mux selct for PERI PLL REF clockWrite 3'b111 :  to select external reference clock as PLL reference clockWrite 3'b000 :  to select on-die clock as PLL reference clock" range="6:4" rwaccess="R/W"/>
	<bitfield id="PLL_REF_CLK_SRC_SEL_PLL_CORE_REF_CLK_SRC_SEL" width="3" begin="2" end="0" resetval="0x0" description="Mux selct for CORE PLL REF clockWrite 3'b111 :  to select external reference clock as PLL reference clockWrite 3'b000 :  to select on-die clock as PLL reference clock" range="2:0" rwaccess="R/W"/>
	</register><register id="TOP_RCM_SOP_MODE_VALUE" acronym="TOP_RCM_SOP_MODE_VALUE" offset="36" width="32" description="Sense on Power mode value.">
		<bitfield id="SOP_MODE_VALUE_VAL" width="32" begin="31" end="0" resetval="0x0" description="Bootmode (SOP_MODE) values and their corresponding mapping  SOP3      SOP2      SOP1      SOP0     Bootmode       0                       0                      0                        0              OSPI Functional Mode[4S]       0                       0                      0                        1              UART Functional Mode         0                       0                      1                        0              OSPI Functional Mode[1S]         0                       0                      1                        1              OSPI Functional Mode[8S]       1                       0                      1                        1              Devboot mode       1                       1                      0                        0              xSPI 8D (SFDP) modeAny undefined values are reserved for future use.Note: Reset value of MMR is 0, but true SOP pin values will latch immediately after PORz reset is released. CPU reads to the MMR will only reflect the SOP mode values latched at reset." range="31:0" rwaccess="R"/>
	</register><register id="TOP_RCM_CLK_LOSS_STATUS" acronym="TOP_RCM_CLK_LOSS_STATUS" offset="40" width="32" description="Coarse detection clock loss status for RC and Crystal.">
		<bitfield id="CLK_LOSS_STATUS_RC_GOOD_BOOT" width="1" begin="8" end="8" resetval="0x1" description="Clock status of RC clock at boot. Reset value will reflect the actual status1 --> clock present at boot0 --> clock not present at boot" range="8" rwaccess="R"/>
	<bitfield id="CLK_LOSS_STATUS_RC_CLOCK_LOSS" width="1" begin="4" end="4" resetval="0x0" description="Coarse detection clock loss status for RC clock. Reset value will reflect the actual status1 --> clock lost0 --> clock good" range="4" rwaccess="R"/>
	<bitfield id="CLK_LOSS_STATUS_CRYSTAL_CLOCK_LOSS" width="1" begin="0" end="0" resetval="0x0" description="Coarse detection clock loss status for Crystal clock. Reset value will reflect the actual status1 --> clock lost0 --> clock good" range="0" rwaccess="R"/>
	</register><register id="TOP_RCM_WARM_RSTTIME1" acronym="TOP_RCM_WARM_RSTTIME1" offset="48" width="32" description="programing Output delay: time between internal warm reset source assert to warm reset pad deassert.">
		<bitfield id="WARM_RSTTIME1_DELAY" width="12" begin="11" end="0" resetval="0x2184" description="Program sufficient delay using this bitfield to keep the WARMRSTn pad active for any external devices relying on the reset signal. Refer to Reset Details Section in TRM for more details.Data should be loaded as multibit.  For example: if value of 0x5 should be selected then 0x555 should be configured to the register.**Note: This bit will only be reset by PORz." range="11:0" rwaccess="R/W"/>
	</register><register id="TOP_RCM_WARM_RSTTIME2" acronym="TOP_RCM_WARM_RSTTIME2" offset="52" width="32" description="programing input Rise delay : time between warm reset pad deassert to chip warm reset deassert.">
		<bitfield id="WARM_RSTTIME2_DELAY" width="12" begin="11" end="0" resetval="0x2184" description="Program the deassertion delay with this bitfield  to control internal system reset deassertion which is relative to the deassertion of WARMRSTn pad.Data should be loaded as multibit.  For example: if value of 0x5 should be selected then 0x555 should be configured to the register.**Note: This bit will only be reset by PORz." range="11:0" rwaccess="R/W"/>
	</register><register id="TOP_RCM_WARM_RSTTIME3" acronym="TOP_RCM_WARM_RSTTIME3" offset="56" width="32" description="programing Input Fall delay  :  time between warm reset pad assert to chip warm reset assert. ">
		<bitfield id="WARM_RSTTIME3_DELAY" width="12" begin="11" end="0" resetval="0x273" description="The glitch filter logic will filter any input pad signal which is LOW for any time less than the  delay  programmed with this bit.This parameter also programmes the delay from external Warmrestn assertion to Internal system warm resetn assertion.Data should be loaded as multibit.  For example: if value of 0x5 should be selected then 0x555 should be configured to the register.**Note: This bit will only be reset by PORz." range="11:0" rwaccess="R/W"/>
	</register><register id="TOP_RCM_WARM_RESET_CONFIG_OV" acronym="TOP_RCM_WARM_RESET_CONFIG_OV" offset="60" width="32" description="">
		<bitfield id="WARM_RESET_CONFIG_OV_VMON_CMP5_OV_RST_EN" width="3" begin="11" end="9" resetval="0x0" description="Enable/Disable VMON Overvoltage CMP5 triggering Warm ResetData should be loaded as multibit.  Write 3'b000 to disable vmon_ov rst_en  Write 3'b111 to enable vmon_ov rst_en  **Note: This bit will only be reset by PORz." range="11:9" rwaccess="R/W"/>
	<bitfield id="WARM_RESET_CONFIG_OV_VMON_CMP3_OV_RST_EN" width="3" begin="8" end="6" resetval="0x0" description="Enable/Disable VMON Overvoltage CMP3 triggering Warm ResetData should be loaded as multibit.  Write 3'b000 to disable vmon_ov rst_en  Write 3'b111 to enable vmon_ov rst_en  **Note: This bit will only be reset by PORz." range="8:6" rwaccess="R/W"/>
	<bitfield id="WARM_RESET_CONFIG_OV_VMON_CMP2_OV_RST_EN" width="3" begin="5" end="3" resetval="0x0" description="Enable/Disable VMON Overvoltage CMP2 triggering Warm ResetData should be loaded as multibit.  Write 3'b000 to disable vmon_ov rst_en  Write 3'b111 to enable vmon_ov rst_en  **Note: This bit will only be reset by PORz." range="5:3" rwaccess="R/W"/>
	<bitfield id="WARM_RESET_CONFIG_OV_VMON_CMP1_OV_RST_EN" width="3" begin="2" end="0" resetval="0x0" description="Enable/Disable VMON Overvoltage CMP1 triggering Warm ResetData should be loaded as multibit.  Write 3'b000 to disable vmon_ov rst_en Write 3'b111 to enable vmon_ov rst_en**Note: This bit will only be reset by PORz." range="2:0" rwaccess="R/W"/>
	</register><register id="TOP_RCM_WARM_RESET_CONFIG_UV" acronym="TOP_RCM_WARM_RESET_CONFIG_UV" offset="64" width="32" description="">
		<bitfield id="WARM_RESET_CONFIG_UV_VMON_CMP8_UV_RST_EN" width="3" begin="20" end="18" resetval="0x0" description="Enable/Disable VMON Undervoltage CMP8 triggering Warm ResetData should be loaded as multibit.  Write 3'b000 to disable vmon_uv rst_en  Write 3'b111 to enable vmon_uv rst_en  **Note: This bit will only be reset by PORz." range="20:18" rwaccess="R/W"/>
	<bitfield id="WARM_RESET_CONFIG_UV_VMON_CMP7_UV_RST_EN" width="3" begin="17" end="15" resetval="0x0" description="Enable/Disable VMON Undervoltage CMP7 triggering Warm ResetData should be loaded as multibit.  Write 3'b000 to disable vmon_uv rst_en  Write 3'b111 to enable vmon_uv rst_en  **Note: This bit will only be reset by PORz." range="17:15" rwaccess="R/W"/>
	<bitfield id="WARM_RESET_CONFIG_UV_VMON_CMP5_UV_RST_EN" width="3" begin="14" end="12" resetval="0x0" description="Enable/Disable VMON Undervoltage CMP5 triggering Warm ResetData should be loaded as multibit.  Write 3'b000 to disable vmon_uv rst_en  Write 3'b111 to enable vmon_uv rst_en  **Note: This bit will only be reset by PORz." range="14:12" rwaccess="R/W"/>
	<bitfield id="WARM_RESET_CONFIG_UV_VMON_CMP3_UV_RST_EN" width="3" begin="11" end="9" resetval="0x0" description="Enable/Disable VMON Undervoltage CMP3 triggering Warm ResetData should be loaded as multibit.  Write 3'b000 to disable vmon_uv rst_en  Write 3'b111 to enable vmon_uv rst_en  **Note: This bit will only be reset by PORz." range="11:9" rwaccess="R/W"/>
	<bitfield id="WARM_RESET_CONFIG_UV_VMON_CMP2_UV_RST_EN" width="3" begin="8" end="6" resetval="0x0" description="Enable/Disable VMON Undervoltage CMP2 triggering Warm ResetData should be loaded as multibit.  Write 3'b000 to disable vmon_uv rst_en  Write 3'b111 to enable vmon_uv rst_en  **Note: This bit will only be reset by PORz." range="8:6" rwaccess="R/W"/>
	<bitfield id="WARM_RESET_CONFIG_UV_VMON_CMP1_UV_RST_EN" width="3" begin="5" end="3" resetval="0x0" description="Enable/Disable VMON Undervoltage CMP1 triggering Warm ResetData should be loaded as multibit.  Write 3'b000 to disable vmon_uv rst_en  Write 3'b111 to enable vmon_uv rst_en  **Note: This bit will only be reset by PORz." range="5:3" rwaccess="R/W"/>
	<bitfield id="WARM_RESET_CONFIG_UV_VMON_CMP0_UV_RST_EN" width="3" begin="2" end="0" resetval="0x0" description="Enable/Disable VMON Undervoltage CMP0 triggering Warm ResetData should be loaded as multibit.  Write 3'b000 to disable vmon_uv rst_en  Write 3'b111 to enable vmon_uv rst_en  **Note: This bit will only be reset by PORz." range="2:0" rwaccess="R/W"/>
	</register><register id="TOP_RCM_WARM_RESET_CONFIG_MISC" acronym="TOP_RCM_WARM_RESET_CONFIG_MISC" offset="68" width="32" description="">
		<bitfield id="WARM_RESET_CONFIG_MISC_CLK_LOSS_SYS_CLK_RST_EN" width="3" begin="5" end="3" resetval="0x0" description="Enable/Disable Clock loss on SYS_CLK triggering Warm ResetData should be loaded as multibit.  Write 3'b000 to disable clk_loss on sys_clk rst_en  Write 3'b111 to enable clk_loss on sys_clk rst_en" range="5:3" rwaccess="R/W"/>
	<bitfield id="WARM_RESET_CONFIG_MISC_ESM_RST_EN" width="3" begin="2" end="0" resetval="0x0" description="Enable/Disable ESM triggering Warm ResetData should be loaded as multibit.  Write 3'b000 to disable esm rst_en  Write 3'b111 to enable esm rst_en" range="2:0" rwaccess="R/W"/>
	</register><register id="TOP_RCM_PLL_CORE_PWRCTRL" acronym="TOP_RCM_PLL_CORE_PWRCTRL" offset="1024" width="32" description="Power control for Core PLL.">
		<bitfield id="PLL_CORE_PWRCTRL_PONIN" width="1" begin="5" end="5" resetval="0x1" description="ON/OFF control of the weak power switch digital. For functionalmode it should be 1'b1" range="5" rwaccess="R/W"/>
	<bitfield id="PLL_CORE_PWRCTRL_PGOODIN" width="1" begin="4" end="4" resetval="0x1" description="ON/OFF control of the strong power switch digital. For functional mode it should be 1'b1" range="4" rwaccess="R/W"/>
	<bitfield id="PLL_CORE_PWRCTRL_RET" width="1" begin="3" end="3" resetval="0x0" description="Save/Restore control for Retention mode. For functional mode itshould be 1'b0" range="3" rwaccess="R/W"/>
	<bitfield id="PLL_CORE_PWRCTRL_ISORET" width="1" begin="2" end="2" resetval="0x0" description="Save/Restore control for Isolation of output pins For functional modeit should be 1'b0" range="2" rwaccess="R/W"/>
	<bitfield id="PLL_CORE_PWRCTRL_ISOSCAN" width="1" begin="1" end="1" resetval="0x0" description="Save/Restore control for Isolation of the Scanout pins. For functionalmode it should be 1'b0" range="1" rwaccess="R/W"/>
	<bitfield id="PLL_CORE_PWRCTRL_OFFMODE" width="1" begin="0" end="0" resetval="0x0" description="Used to switch OFF the logic on VDDA. For functional mode itshould be 1'b0" range="0" rwaccess="R/W"/>
	</register><register id="TOP_RCM_PLL_CORE_CLKCTRL" acronym="TOP_RCM_PLL_CORE_CLKCTRL" offset="1028" width="32" description="Clock control for Core PLL.">
		<bitfield id="PLL_CORE_CLKCTRL_CYCLESLIPEN" width="1" begin="31" end="31" resetval="0x0" description="FailSafe enable to trigger re-calibration in case CycleSlip occurs between REFCLK and FBCLK. Cycleslip could be caused if loop is not able to track input clock. Default = 1'b0 recommended" range="31" rwaccess="R/W"/>
	<bitfield id="PLL_CORE_CLKCTRL_ENSSC" width="1" begin="30" end="30" resetval="0x0" description="Controls Clock SpReading. SSC is not supported. Should be set to 0x0 to disable clock spReading." range="30" rwaccess="R/W"/>
	<bitfield id="PLL_CORE_CLKCTRL_CLKDCOLDOEN" width="1" begin="29" end="29" resetval="0x0" description="Synchronously enables/disables CLKDCOLDO0x0 : synchronously disables CLKDCOLDO0x1 : synchronously enables CLKDCOLDO" range="29" rwaccess="R/W"/>
	<bitfield id="PLL_CORE_CLKCTRL_IDLE" width="1" begin="23" end="23" resetval="0x1" description="Sets PLL to Idle mode0x0 : When SYSRESET = 0 and TINITZ = 1 IDLE = 0 PLL will go toActive and Locked0x1 : When SYSRESET = 0 and TINITZ = 1 IDLE = 1 PLL will go toIdle Bypass low powe" range="23" rwaccess="R/W"/>
	<bitfield id="PLL_CORE_CLKCTRL_BYPASSACKZ" width="1" begin="22" end="22" resetval="0x0" description="BYPASSACKZ is a special purpose input to the module. In generalthis input is expected to be tied to static low. For the output clocks ofthe module that do not have an internal bypass mux viz.CLKDCOLDO and CLKOUTLDO, a bypass mux could beimplemented external to the module." range="22" rwaccess="R/W"/>
	<bitfield id="PLL_CORE_CLKCTRL_STBYRET" width="1" begin="21" end="21" resetval="0x0" description="Standby retention control0x0 : prepares ADPLLLJ for relock when out of retention byremoving the gating on all internal clocks.0x1 : prepares ADPLLLJ for retention by gating all the internalclocks." range="21" rwaccess="R/W"/>
	<bitfield id="PLL_CORE_CLKCTRL_CLKOUTEN" width="1" begin="20" end="20" resetval="0x0" description="CLKOUT enable or disable0x0 : synchronously disables CLKOUT0x1 : synchronously enables CLKOUT" range="20" rwaccess="R/W"/>
	<bitfield id="PLL_CORE_CLKCTRL_CLKOUTLDOEN" width="1" begin="19" end="19" resetval="0x1" description="Synchronously enables/disables CLKOUTLDO 0x0 : synchronously disables CLKOUTLDO 0x1 : synchronously enables CLKOUTLDO" range="19" rwaccess="R/W"/>
	<bitfield id="PLL_CORE_CLKCTRL_ULOWCLKEN" width="1" begin="18" end="18" resetval="0x0" description="Select CLKOUT source in bypass0x0: When ADPLLLJ in bypass mode, CLKOUT = CLKINP/[N2+1]0x1: When ADPLLLJ in bypass mode, CLKOUT = CLKINPULOW." range="18" rwaccess="R/W"/>
	<bitfield id="PLL_CORE_CLKCTRL_CLKDCOLDOPWDNZ" width="1" begin="17" end="17" resetval="0x0" description="0 Asynchronous power down for CLKDCOLDO o/p." range="17" rwaccess="R/W"/>
	<bitfield id="PLL_CORE_CLKCTRL_M2PWDNZ" width="1" begin="16" end="16" resetval="0x1" description="M2 divider power down mode0x0: Asynchronous power down for M2 divider0x1 : M2 divider is functional" range="16" rwaccess="R/W"/>
	<bitfield id="PLL_CORE_CLKCTRL_STOPMODE" width="1" begin="14" end="14" resetval="0x1" description="When in Lossclk/Stbyret 0x0 : Limp mode 0x1 : Stopmode" range="14" rwaccess="R/W"/>
	<bitfield id="PLL_CORE_CLKCTRL_SELFREQDCO" width="3" begin="12" end="10" resetval="0x4" description="DCO Clock [DCOCLK = CLKINP * [M/[N+1]]] frequency rangeselector.0x0: Reserved0x2: HS2 : DCOCLK range is from 500 MHz to1000MHz0x3: Reserved0x4: HS1: DCOCLK range is from1000MHz to2000MHz0x5: Reserved" range="12:10" rwaccess="R/W"/>
	<bitfield id="PLL_CORE_CLKCTRL_RELAXED_LOCK" width="1" begin="8" end="8" resetval="0x0" description="Decides when FREQLOCK asserted0x0: FREQLOCK asserted when DC frequency error less than 1%0x1: FREQLOCK asserted when DC frequency error less than 2%" range="8" rwaccess="R/W"/>
	<bitfield id="PLL_CORE_CLKCTRL_SSCTYPE" width="1" begin="1" end="1" resetval="0x0" description="SSC Type - This should be configured as 1'b0. The module supports spread spectrum clocking [SSC] on its output clocks." range="1" rwaccess="R/W"/>
	<bitfield id="PLL_CORE_CLKCTRL_TINTZ" width="1" begin="0" end="0" resetval="0x0" description="PLL core soft reset. TINITZ activation [Low] gives softreset to ADPLLLJ. TINITZ does not reset the entire digital control logic; it forces the FSM into RESET State so that ADPLLLJ could restart." range="0" rwaccess="R/W"/>
	</register><register id="TOP_RCM_PLL_CORE_TENABLE" acronym="TOP_RCM_PLL_CORE_TENABLE" offset="1032" width="32" description="Trigger enable for core PLL.">
		<bitfield id="PLL_CORE_TENABLE_TENABLE" width="1" begin="0" end="0" resetval="0x0" description="Signal TENABLE loads REGM, REGN, REGSD and SELFREQDCO data. M, N. SD and SELFREQDCO latch [active rise edge]" range="0" rwaccess="R/W"/>
	</register><register id="TOP_RCM_PLL_CORE_TENABLEDIV" acronym="TOP_RCM_PLL_CORE_TENABLEDIV" offset="1036" width="32" description="Load Trigger for divider control value for Core PLL.">
		<bitfield id="PLL_CORE_TENABLEDIV_TENABLEDIV" width="1" begin="0" end="0" resetval="0x0" description="TENABLEDIV rising edge loads the values of M2REG and N2REG into ADPLLLJ register.  TENABLEDIV could be activated anytime when the DPLL digital is in power-up condition. M2 and N2 latch [active rise edge]" range="0" rwaccess="R/W"/>
	</register><register id="TOP_RCM_PLL_CORE_M2NDIV" acronym="TOP_RCM_PLL_CORE_M2NDIV" offset="1040" width="32" description="M2N config register for core PLL.">
