ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263P/TOP_RCM_TOP_RCM_53200000h.xml
	<bitfield id="PLL_PER_CLKCTRL_ULOWCLKEN" width="1" begin="18" end="18" resetval="0x0" description="Select CLKOUT source in bypass0x0: When ADPLLLJ in bypass mode, CLKOUT = CLKINP/[N2+1]0x1: When ADPLLLJ in bypass mode, CLKOUT = CLKINPULOW." range="18" rwaccess="R/W"/>
	<bitfield id="PLL_PER_CLKCTRL_CLKDCOLDOPWDNZ" width="1" begin="17" end="17" resetval="0x0" description="0 Asynchronous power down for CLKDCOLDO o/p." range="17" rwaccess="R/W"/>
	<bitfield id="PLL_PER_CLKCTRL_M2PWDNZ" width="1" begin="16" end="16" resetval="0x1" description="M2 divider power down mode0x0: Asynchronous power down for M2 divider0x1 : M2 divider is functional" range="16" rwaccess="R/W"/>
	<bitfield id="PLL_PER_CLKCTRL_STOPMODE" width="1" begin="14" end="14" resetval="0x1" description="When in Lossclk/Stbyret 0x0 : Limp mode 0x1 : Stopmode" range="14" rwaccess="R/W"/>
	<bitfield id="PLL_PER_CLKCTRL_SELFREQDCO" width="3" begin="12" end="10" resetval="0x4" description="DCO Clock [DCOCLK = CLKINP * [M/[N+1]]] frequency rangeselector.0x0: Reserved0x2: HS2 : DCOCLK range is from 500 MHz to1000MHz0x3: Reserved0x4: HS1: DCOCLK range is from1000MHz to2000MHz0x5: Reserved" range="12:10" rwaccess="R/W"/>
	<bitfield id="PLL_PER_CLKCTRL_RELAXED_LOCK" width="1" begin="8" end="8" resetval="0x0" description="Decides when FREQLOCK asserted0x0: FREQLOCK asserted when DC frequency error less than 1%0x1: FREQLOCK asserted when DC frequency error less than 2%" range="8" rwaccess="R/W"/>
	<bitfield id="PLL_PER_CLKCTRL_SSCTYPE" width="1" begin="1" end="1" resetval="0x0" description="SSC Type - This should be configured as 1'b0. The module supports spread spectrum clocking [SSC] on its output clocks." range="1" rwaccess="R/W"/>
	<bitfield id="PLL_PER_CLKCTRL_TINTZ" width="1" begin="0" end="0" resetval="0x0" description="PLL core soft reset. TINITZ activation [Low] gives softreset to ADPLLLJ. TINITZ does not reset the entire digital control logic; it forces the FSM into RESET State so that ADPLLLJ could restart." range="0" rwaccess="R/W"/>
	</register><register id="TOP_RCM_PLL_PER_TENABLE" acronym="TOP_RCM_PLL_PER_TENABLE" offset="2056" width="32" description="Trigger enable for Peripheral PLL.">
		<bitfield id="PLL_PER_TENABLE_TENABLE" width="1" begin="0" end="0" resetval="0x0" description="Signal TENABLE loads REGM, REGN, REGSD and SELFREQDCO data. M, N. SD and SELFREQDCO latch [active rise edge]" range="0" rwaccess="R/W"/>
	</register><register id="TOP_RCM_PLL_PER_TENABLEDIV" acronym="TOP_RCM_PLL_PER_TENABLEDIV" offset="2060" width="32" description="Load Trigger for divider control value for peripheral PLL.">
		<bitfield id="PLL_PER_TENABLEDIV_TENABLEDIV" width="1" begin="0" end="0" resetval="0x0" description="TENABLEDIV rising edge loads the values of M2REG and N2REG into ADPLLLJ register.  TENABLEDIV could be activated anytime when the DPLL digital is in power-up condition. M2 and N2 latch [active rise edge]" range="0" rwaccess="R/W"/>
	</register><register id="TOP_RCM_PLL_PER_M2NDIV" acronym="TOP_RCM_PLL_PER_M2NDIV" offset="2064" width="32" description="M2N config register for peripheral PLL.">
		<bitfield id="PLL_PER_M2NDIV_M2" width="7" begin="22" end="16" resetval="0x0" description="Post-divider is REGM2" range="22:16" rwaccess="R/W"/>
	<bitfield id="PLL_PER_M2NDIV_N" width="8" begin="7" end="0" resetval="0x19" description="Pre-divider is REGN+1" range="7:0" rwaccess="R/W"/>
	</register><register id="TOP_RCM_PLL_PER_MN2DIV" acronym="TOP_RCM_PLL_PER_MN2DIV" offset="2068" width="32" description="MN2 config register for peripheral PLL.">
		<bitfield id="PLL_PER_MN2DIV_N2" width="4" begin="19" end="16" resetval="0x0" description="Bypass divider is REGN2+1" range="19:16" rwaccess="R/W"/>
	<bitfield id="PLL_PER_MN2DIV_M" width="12" begin="11" end="0" resetval="0x1536" description="Feedback Multiplier is REGM" range="11:0" rwaccess="R/W"/>
	</register><register id="TOP_RCM_PLL_PER_FRACDIV" acronym="TOP_RCM_PLL_PER_FRACDIV" offset="2072" width="32" description="Fractionsl divider and Sigma Delta config register for peripheral PLL.">
		<bitfield id="PLL_PER_FRACDIV_REGSD" width="8" begin="31" end="24" resetval="0x8" description="Sigma-Delta DividerShould be set by s/w to provide optimum jitter performance.DPLL_SD_DIV = CEILING [[DPLL_MULT/[DPLL_DIV+1]] * CLKINP/ 250], where CLKINP is the input clock of the DPLL in MHz" range="31:24" rwaccess="R/W"/>
	<bitfield id="PLL_PER_FRACDIV_FRACTIONALM" width="18" begin="17" end="0" resetval="0x0" description="Fractional part of the M divider.The 18bit FractionalM value is loaded into DPLL on the rising edge of TENABLE signal .To enable Integer only division FractionalM should be set to 18'b0." range="17:0" rwaccess="R/W"/>
	</register><register id="TOP_RCM_PLL_PER_BWCTRL" acronym="TOP_RCM_PLL_PER_BWCTRL" offset="2076" width="32" description="Loop bandwidth control for peripheral PLL.">
		<bitfield id="PLL_PER_BWCTRL_BWCONTROL" width="2" begin="2" end="1" resetval="0x0" description="Change Loop Bandwidth" range="2:1" rwaccess="R/W"/>
	<bitfield id="PLL_PER_BWCTRL_BW_INCR_DECRZ" width="1" begin="0" end="0" resetval="0x0" description="Direction of Loop Bandwidth0x0 : decrease BW0x1 : increase BW" range="0" rwaccess="R/W"/>
	</register><register id="TOP_RCM_PLL_PER_FRACCTRL" acronym="TOP_RCM_PLL_PER_FRACCTRL" offset="2080" width="32" description="Spread Specturm control for peripheral PLL - Not Supported.">
		<bitfield id="PLL_PER_FRACCTRL_DOWNSPREAD" width="1" begin="31" end="31" resetval="0x0" description="Controls frequency spread0x0 : enables both side frequency spread about the programmed frequency.0x1 : enables low frequency spread only" range="31" rwaccess="R/W"/>
	<bitfield id="PLL_PER_FRACCTRL_MODFREQDIVIDEREXPONENT" width="3" begin="30" end="28" resetval="0x0" description="Exponent of the REFCLK divider to define the modulation frequency." range="30:28" rwaccess="R/W"/>
	<bitfield id="PLL_PER_FRACCTRL_MODFREQDIVIDERMANTISSA" width="7" begin="27" end="21" resetval="0x0" description="Mantissa of the REFCLK divider to define the modulation frequency" range="27:21" rwaccess="R/W"/>
	<bitfield id="PLL_PER_FRACCTRL_DELTAMSTEPINTEGER" width="3" begin="20" end="18" resetval="0x0" description="Integer part of Frequency Spread control" range="20:18" rwaccess="R/W"/>
	<bitfield id="PLL_PER_FRACCTRL_DELTAMSTEPFRACTION" width="18" begin="17" end="0" resetval="0x0" description="The fraction part of Frequency Spread control" range="17:0" rwaccess="R/W"/>
	</register><register id="TOP_RCM_PLL_PER_STATUS" acronym="TOP_RCM_PLL_PER_STATUS" offset="2084" width="32" description="Peripheral PLL status regiser.">
		<bitfield id="PLL_PER_STATUS_PONOUT" width="1" begin="31" end="31" resetval="0x1" description="Status of the weak power-switch0x0 : indicates the/OFF status of the weak power-switch in digital toSOC.0x1 : ndicates the ON status of the weak power-switch in digital toSOC." range="31" rwaccess="R"/>
	<bitfield id="PLL_PER_STATUS_PGOODOUT" width="1" begin="30" end="30" resetval="0x1" description="Status of the strong power-switch0x0 : indicates the/OFF status of the strong power-switch in digital toSOC.0x1 : ndicates the ON status of the strong power-switch in digital toSOC." range="30" rwaccess="R"/>
	<bitfield id="PLL_PER_STATUS_LDOPWDN" width="1" begin="29" end="29" resetval="0x1" description="1'b1 indicates ADPLLLJ internal LDO is power down. VDDLDOOUT willbe un-defined in this condition" range="29" rwaccess="R"/>
	<bitfield id="PLL_PER_STATUS_RECAL_BSTATUS3" width="1" begin="28" end="28" resetval="0x0" description="Recalibration status flag. 1 ADPLLLJ requires recalibration" range="28" rwaccess="R"/>
	<bitfield id="PLL_PER_STATUS_RECAL_OPPIN" width="1" begin="27" end="27" resetval="0x0" description="Recalibration status flag. 1 ADPLLLJ requires recalibration" range="27" rwaccess="R"/>
	<bitfield id="PLL_PER_STATUS_CLKOUTLDOENACK" width="1" begin="12" end="12" resetval="0x1" description="Indicates the enable/disable condition of CLKOUTLDOEN0x0 = CLKOUTLDO gating completed0x1 = CLKOUTLDO enabling completed" range="12" rwaccess="R"/>
	<bitfield id="PLL_PER_STATUS_CLKDCOLDOACK" width="1" begin="11" end="11" resetval="0x0" description="Indicates the enable/disable condition of CLKDCOLDOEN0x0 = CLKDCOLDO gating completed0x1 = CLKDCOLDO enabling completed" range="11" rwaccess="R"/>
	<bitfield id="PLL_PER_STATUS_PHASELOCK" width="1" begin="10" end="10" resetval="0x0" description="Status on PHASELOCK output pin" range="10" rwaccess="R"/>
	<bitfield id="PLL_PER_STATUS_FREQLOCK" width="1" begin="9" end="9" resetval="0x0" description="Status on FREQLOCK output pin" range="9" rwaccess="R"/>
	<bitfield id="PLL_PER_STATUS_BYPASSACK" width="1" begin="8" end="8" resetval="0x1" description="Status of BYPASSACK output pin" range="8" rwaccess="R"/>
	<bitfield id="PLL_PER_STATUS_STBYRETACK" width="1" begin="7" end="7" resetval="0x0" description="Standby and retention status0x0: indicates to SOC that all internal clocks in ADPLLLJ are activeand it is starting the relock process.0x1: indicates to SOC that all internal clocks in ADPLLLJ are gatedand it is ready for retention." range="7" rwaccess="R"/>
	<bitfield id="PLL_PER_STATUS_LOSSREF" width="1" begin="6" end="6" resetval="0x1" description="Reference input loss is indicated by 1'b0." range="6" rwaccess="R"/>
	<bitfield id="PLL_PER_STATUS_CLKOUTENACK" width="1" begin="5" end="5" resetval="0x0" description="Indicates the enable/disable condition of CLKOUTEN0x0 = CLKOUT gating completed0x1 = CLKOUT enabling completed" range="5" rwaccess="R"/>
	<bitfield id="PLL_PER_STATUS_LOCK2" width="1" begin="4" end="4" resetval="0x0" description="ADPLL internal loop lock status" range="4" rwaccess="R"/>
	<bitfield id="PLL_PER_STATUS_M2CHANGEACK" width="1" begin="3" end="3" resetval="0x0" description="Acknowledge for change to M2 divider. Toggles from 1-0 or 0-1[depending on current value] once CLKOUT frequency change hascompleted." range="3" rwaccess="R"/>
	<bitfield id="PLL_PER_STATUS_SSCACK" width="1" begin="2" end="2" resetval="0x0" description="Spread Spectrum status0x0 : Spread-spectrum Clocking is disabled on output clocks0x1 : Spread-spectrum Clocking is enabled on output clocks" range="2" rwaccess="R"/>
	<bitfield id="PLL_PER_STATUS_HIGHJITTER" width="1" begin="1" end="1" resetval="0x0" description="1'b1 indicates jitter. After PHASELOCK is asserted high, theHIGHJITTER flag is asserted high if phase error between REFCLKand FBCLK greater than 24%." range="1" rwaccess="R"/>
	<bitfield id="PLL_PER_STATUS_BYPASS" width="1" begin="0" end="0" resetval="0x1" description="Bypass status signal. 1 CLKOUT in bypass" range="0" rwaccess="R"/>
	</register><register id="TOP_RCM_PLL_PER_HSDIVIDER" acronym="TOP_RCM_PLL_PER_HSDIVIDER" offset="2088" width="32" description="Peripheral PLL high speed divider config.">
		<bitfield id="PLL_PER_HSDIVIDER_LDOPWDNACK" width="1" begin="17" end="17" resetval="0x0" description="LDO Power Down Ack" range="17" rwaccess="R"/>
	<bitfield id="PLL_PER_HSDIVIDER_BYPASSACKZ" width="1" begin="16" end="16" resetval="0x0" description="HSDIVIDER Bypass Ack" range="16" rwaccess="R"/>
	<bitfield id="PLL_PER_HSDIVIDER_TENABLEDIV" width="1" begin="2" end="2" resetval="0x0" description="TENABLEDIV rising edge loads the values of M2REG and N2REG into ADPLLLJ register.  TENABLEDIV could be activated anytime when the DPLL digital is in power-up condition. M2 and N2 latch [active rise edge]" range="2" rwaccess="R/W"/>
	<bitfield id="PLL_PER_HSDIVIDER_LDOPWDN" width="1" begin="1" end="1" resetval="0x0" description="1'b1 indicates ADPLLLJ internal LDO is power down. VDDLDOOUT willbe un-defined in this condition" range="1" rwaccess="R/W"/>
	<bitfield id="PLL_PER_HSDIVIDER_BYPASS" width="1" begin="0" end="0" resetval="0x0" description="HSDIVIDER Bypass" range="0" rwaccess="R/W"/>
	</register><register id="TOP_RCM_PLL_PER_HSDIVIDER_CLKOUT0" acronym="TOP_RCM_PLL_PER_HSDIVIDER_CLKOUT0" offset="2092" width="32" description="Peripheral PLL high speed divider clock 0 control.">
		<bitfield id="PLL_PER_HSDIVIDER_CLKOUT0_PWDN" width="1" begin="12" end="12" resetval="0x0" description="Power down for HSDIVIDER CLKOUT0 divider and hence CLKOUT0 output0h[R/W] = CLKOUT0 divider active1h[R/W] = CLKOUT0 divider is powered down" range="12" rwaccess="R/W"/>
	<bitfield id="PLL_PER_HSDIVIDER_CLKOUT0_STATUS" width="1" begin="9" end="9" resetval="0x0" description="HSDIVIDER CLKOUT0 status0h[R] = The clock output is gated1h[R] = The clock output is enabled" range="9" rwaccess="R"/>
	<bitfield id="PLL_PER_HSDIVIDER_CLKOUT0_GATE_CTRL" width="1" begin="8" end="8" resetval="0x0" description="Control gating of HSDIVIDER CLKOUT00h[R/W] = Automatically gate this clock when there is nodependency for it1h[R/W] = Force this clock to stay enabled even if there is norequest" range="8" rwaccess="R/W"/>
	<bitfield id="PLL_PER_HSDIVIDER_CLKOUT0_DIVCHACK" width="1" begin="5" end="5" resetval="0x0" description="Toggle on this status bit after changing HSDIVIDER_CLKOUT0_DIVindicates that the change in divider value has taken effect" range="5" rwaccess="R"/>
	<bitfield id="PLL_PER_HSDIVIDER_CLKOUT0_DIV" width="5" begin="4" end="0" resetval="0x11" description="DPLL post-divider factor, HSDIVIDER CLKOUT0, for internal clock generation.Divide values from 1 to 31.0h[R/W] = Reserved" range="4:0" rwaccess="R/W"/>
	</register><register id="TOP_RCM_PLL_PER_HSDIVIDER_CLKOUT1" acronym="TOP_RCM_PLL_PER_HSDIVIDER_CLKOUT1" offset="2096" width="32" description="Peripheral PLL high speed divider clock 1 control.">
		<bitfield id="PLL_PER_HSDIVIDER_CLKOUT1_PWDN" width="1" begin="12" end="12" resetval="0x0" description="Power down for HSDIVIDER CLKOUT1 divider and hence CLKOUT1 output0h[R/W] = CLKOUT1 divider active1h[R/W] = CLKOUT1 divider is powered down" range="12" rwaccess="R/W"/>
	<bitfield id="PLL_PER_HSDIVIDER_CLKOUT1_STATUS" width="1" begin="9" end="9" resetval="0x0" description="HSDIVIDER CLKOUT1 status0h[R] = The clock output is gated1h[R] = The clock output is enabled" range="9" rwaccess="R"/>
	<bitfield id="PLL_PER_HSDIVIDER_CLKOUT1_GATE_CTRL" width="1" begin="8" end="8" resetval="0x0" description="Control gating of HSDIVIDER CLKOUT10h[R/W] = Automatically gate this clock when there is nodependency for it1h[R/W] = Force this clock to stay enabled even if there is norequest" range="8" rwaccess="R/W"/>
	<bitfield id="PLL_PER_HSDIVIDER_CLKOUT1_DIVCHACK" width="1" begin="5" end="5" resetval="0x0" description="Toggle on this status bit after changing HSDIVIDER_CLKOUT1_DIVindicates that the change in divider value has taken effect" range="5" rwaccess="R"/>
	<bitfield id="PLL_PER_HSDIVIDER_CLKOUT1_DIV" width="5" begin="4" end="0" resetval="0x9" description="DPLL post-divider factor, HSDIVIDER CLKOUT1, for internal clock generation.Divide values from 1 to 31.0h[R/W] = Reserved" range="4:0" rwaccess="R/W"/>
	</register><register id="TOP_RCM_PLL_PER_HSDIVIDER_CLKOUT2" acronym="TOP_RCM_PLL_PER_HSDIVIDER_CLKOUT2" offset="2100" width="32" description="Peripheral PLL high speed divider clock 2 control.">
		<bitfield id="PLL_PER_HSDIVIDER_CLKOUT2_PWDN" width="1" begin="12" end="12" resetval="0x0" description="Power down for HSDIVIDER CLKOUT2 divider and hence CLKOUT2 output0h[R/W] = CLKOUT2 divider active1h[R/W] = CLKOUT2 divider is powered down" range="12" rwaccess="R/W"/>
	<bitfield id="PLL_PER_HSDIVIDER_CLKOUT2_STATUS" width="1" begin="9" end="9" resetval="0x0" description="HSDIVIDER CLKOUT2 status0h[R] = The clock output is gated1h[R] = The clock output is enabled" range="9" rwaccess="R"/>
	<bitfield id="PLL_PER_HSDIVIDER_CLKOUT2_GATE_CTRL" width="1" begin="8" end="8" resetval="0x0" description="Control gating of HSDIVIDER CLKOUT20h[R/W] = Automatically gate this clock when there is nodependency for it1h[R/W] = Force this clock to stay enabled even if there is norequest" range="8" rwaccess="R/W"/>
	<bitfield id="PLL_PER_HSDIVIDER_CLKOUT2_DIVCHACK" width="1" begin="5" end="5" resetval="0x0" description="Toggle on this status bit after changing HSDIVIDER_CLKOUT2_DIVindicates that the change in divider value has taken effect" range="5" rwaccess="R"/>
	<bitfield id="PLL_PER_HSDIVIDER_CLKOUT2_DIV" width="5" begin="4" end="0" resetval="0x11" description="DPLL post-divider factor, HSDIVIDER CLKOUT2, for internal clock generation.Divide values from 1 to 31.0h[R/W] = Reserved" range="4:0" rwaccess="R/W"/>
	</register><register id="TOP_RCM_PLL_PER_RSTCTRL" acronym="TOP_RCM_PLL_PER_RSTCTRL" offset="2108" width="32" description="Peripheral PLL reset control.">
		<bitfield id="PLL_PER_RSTCTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="SW Reset override for the PLLWrite 3'b111 : Override is enabled and Reset is asserted" range="2:0" rwaccess="R/W"/>
	</register><register id="TOP_RCM_PLL_PER_HSDIVIDER_RSTCTRL" acronym="TOP_RCM_PLL_PER_HSDIVIDER_RSTCTRL" offset="2112" width="32" description="Peripheral PLL high speed divider reset control.">
		<bitfield id="PLL_PER_HSDIVIDER_RSTCTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="SW Reset override for the HSDIVIDERWrite 3'b111 : Override is enabled and Reset is asserted" range="2:0" rwaccess="R/W"/>
	</register><register id="TOP_RCM_CLKOUT0_CLK_SRC_SEL" acronym="TOP_RCM_CLKOUT0_CLK_SRC_SEL" offset="3072" width="32" description="Clock Source select register for CLKOUT clock.">
		<bitfield id="CLKOUT0_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for MSS CLKOUT .Data should be loaded as multibit.  For example: if Clock source 0x5 should be selected then 0x555 should be configured to the register.Use the following values to select clk src-0x000 - WUCPUCLK0x111 - DPLL_CORE_HSDIV0_CLKOUT00x222 - DPLL_CORE_HSDIV0_CLKOUT10x333 - DPLL_PER_HSDIV0_CLKOUT00x444 - DPLL_PER_HSDIV0_CLKOUT10x555 - RCCLK10M0x666 - RCCLK32K0x777 - CTPS_GENF0" range="11:0" rwaccess="R/W"/>
	</register><register id="TOP_RCM_CLKOUT1_CLK_SRC_SEL" acronym="TOP_RCM_CLKOUT1_CLK_SRC_SEL" offset="3076" width="32" description="Clock Source select register for CLKOUT clock.">
		<bitfield id="CLKOUT1_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for MSS CLKOUT .Data should be loaded as multibit.  For example: if Clock source 0x5 should be selected then 0x555 should be configured to the register.Use the following values to select clk src-0x000 - WUCPUCLK0x111 - DPLL_CORE_HSDIV0_CLKOUT00x222 - DPLL_CORE_HSDIV0_CLKOUT10x333 - DPLL_PER_HSDIV0_CLKOUT00x444 - DPLL_PER_HSDIV0_CLKOUT10x555 - RCCLK10M0x666 - RCCLK32K0x777 - CTPS_GENF0" range="11:0" rwaccess="R/W"/>
	</register><register id="TOP_RCM_CLKOUT0_DIV_VAL" acronym="TOP_RCM_CLKOUT0_DIV_VAL" offset="3080" width="32" description="Clock Divider register for CLKOUT clock.">
		<bitfield id="CLKOUT0_DIV_VAL_CLKDIV" width="12" begin="11" end="0" resetval="0x0" description="Divider value for CLKOUT selected clock..To set the divider value of [n+1] configure the register to '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="TOP_RCM_CLKOUT1_DIV_VAL" acronym="TOP_RCM_CLKOUT1_DIV_VAL" offset="3084" width="32" description="Clock Divider register for CLKOUT clock.">
		<bitfield id="CLKOUT1_DIV_VAL_CLKDIV" width="12" begin="11" end="0" resetval="0x0" description="Divider value for CLKOUT selected clock..To set the divider value of [n+1] configure the register to '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="TOP_RCM_CLKOUT0_CLK_GATE" acronym="TOP_RCM_CLKOUT0_CLK_GATE" offset="3088" width="32" description="Clock Gating register for CLKOUT clock.">
		<bitfield id="CLKOUT0_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Only for debug- Functionality not guaranteed Clock gating config for  MSS CLKOUTData should be loaded as multibit.  Write 3'b000 : Clock is ungated [multibit 000]Write 3'b111 : Clock is gated [multibit 111]" range="2:0" rwaccess="R/W"/>
	</register><register id="TOP_RCM_CLKOUT1_CLK_GATE" acronym="TOP_RCM_CLKOUT1_CLK_GATE" offset="3092" width="32" description="Clock Gating register for CLKOUT clock.">
		<bitfield id="CLKOUT1_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Only for debug- Functionality not guaranteed Clock gating config for  MSS CLKOUTData should be loaded as multibit.  Write 3'b000 : Clock is ungated [multibit 000]Write 3'b111 : Clock is gated [multibit 111]" range="2:0" rwaccess="R/W"/>
	</register><register id="TOP_RCM_CLKOUT0_CLK_STATUS" acronym="TOP_RCM_CLKOUT0_CLK_STATUS" offset="3096" width="32" description="Clock Status register for CLKOUT clock.">
		<bitfield id="CLKOUT0_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for CLKOUT Clock" range="15:8" rwaccess="R"/>
	<bitfield id="CLKOUT0_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for CLKOUT Clock" range="7:0" rwaccess="R"/>
	</register><register id="TOP_RCM_CLKOUT1_CLK_STATUS" acronym="TOP_RCM_CLKOUT1_CLK_STATUS" offset="3100" width="32" description="Clock Status register for CLKOUT clock.">
		<bitfield id="CLKOUT1_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for CLKOUT Clock" range="15:8" rwaccess="R"/>
	<bitfield id="CLKOUT1_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for CLKOUT Clock" range="7:0" rwaccess="R"/>
	</register><register id="TOP_RCM_TRCCLKOUT_CLK_SRC_SEL" acronym="TOP_RCM_TRCCLKOUT_CLK_SRC_SEL" offset="3104" width="32" description="Clock Source select register for TRC clkout.">
		<bitfield id="TRCCLKOUT_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for TRC ClkoutData should be loaded as multibit.  For example: if Clock source 0x5 should be selected then 0x555 should be configured to the register.Use the following values to select clk src-0x000 - WUCPUCLK0x111 - DPLL_CORE_HSDIV0_CLKOUT00x222 - DPLL_CORE_HSDIV0_CLKOUT10x333 - DPLL_PER_HSDIV0_CLKOUT00x444 - DPLL_PER_HSDIV0_CLKOUT10x555 - RCCLK10M0x666 - XTALCLK0x777 - RCCLK10M" range="11:0" rwaccess="R/W"/>
	</register><register id="TOP_RCM_TRCCLKOUT_DIV_VAL" acronym="TOP_RCM_TRCCLKOUT_DIV_VAL" offset="3108" width="32" description="Clock Divider register for TRC clkout.">
		<bitfield id="TRCCLKOUT_DIV_VAL_CLKDIV" width="12" begin="11" end="0" resetval="0x0" description="Divider value for CLKOUT selected clock..To set the divider value of [n+1] configure the register to '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="TOP_RCM_TRCCLKOUT_CLK_GATE" acronym="TOP_RCM_TRCCLKOUT_CLK_GATE" offset="3112" width="32" description="Clock Gating register for TRC clkout.">
		<bitfield id="TRCCLKOUT_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Clock gatring config for TRC ClkoutData should be loaded as multibit.  Write 3'b000 : Clock is ungated [multibit 000]Write 3'b111 : Clock is gated [multibit 111]" range="2:0" rwaccess="R/W"/>
	</register><register id="TOP_RCM_TRCCLKOUT_CLK_STATUS" acronym="TOP_RCM_TRCCLKOUT_CLK_STATUS" offset="3116" width="32" description="Clock Status register for TRC clkout.">
		<bitfield id="TRCCLKOUT_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for PMIC Clkout Clock" range="15:8" rwaccess="R"/>
